posts/Using-git-subtree.html
<!DOCTYPE html>
<html>
  <head>
  <meta charset="utf-8">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <title>Easily deploying to GitHub pages</title>

  <meta name="description" content="Using git-branch to create a detached branch of yuor repo that is then linked into master">
  <meta name="keywords" content="{% if page.keywords %}blog, static site, elisp, Emacs{% else %}blog, static site, elisp, Emacs{% endif %}">

  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">

  
  <link rel="stylesheet" href="/css/main.css">
  <link rel="stylesheet" href="/css/font-awesome.min.css">

  <link rel="canonical" href="posts/Using-git-subtree.html">
    <link rel="alternate" type="application/rss+xml" title="Perry Documentation" href="http://localhost:8080//feed.xml">

</head>

  <body>
    <main class="wrapper">
    <header class="site-header">
  <nav class="nav">
    <div class="container">
      <h1 class="logo">
        <a href="/">
        Perry Documentation
        </a>
      </h1>
      <ul class="navbar">
        <li>
  <a class="menu-item "
    href="/install.html"  title="">
    Installation</a>
</li>

      </ul>
    </div>
  </nav>
</header>

    <div class="container">
      <p>
Like so many other projects, this one lives on Github. Github pages is a great way to have a website for your project, but the way it is implemented might be tricky, if you decide not to use <a href="https://jekyllrb.com/">Jekyll</a>.
</p>

<p>
Github projects are located in a child-folder of your Github accound, in perry.el's case <code>XXX</code>. The projects website is located in the gh-pages branch of the project.
</p>

<p>
The easiest way to setup your project to have you project in <code>master</code>, your branches in <code>whatever</code> and your blog/documentation in <code>gh-pages</code> is:
</p>

<p>
(This script needs to be ran from a repo checked out from GitHub)
</p>

<script src="https://gist.github.com/QWxleA/412d0b7fb737afcf61cc8c8d42545942.js"></script>

<p>
When the script is done, you end up with:
</p>

<pre class="example">
/repository
/repository/.nojekyll          -&gt; keeps GitHub from trying to run jekyll on your project
/repository/.gitignore         -&gt; keeps _export from being checked into the master branch
/repository/_export            -&gt; linked to the gh-pages branch
/repository/_export/index.html -&gt; your projects documentation
</pre>

<div id="outline-container-org370d306" class="outline-2">
<h2 id="org370d306">Alternative</h2>
<div class="outline-text-2" id="text-org370d306">
<p>
As an alternative you can use <a href="https://github.com/blog/2228-simpler-github-pages-publishing">Simpler GitHub Pages publishing</a>, but this has the downside that it has your generated content in your master branch.
</p>
</div>
</div>

      <footer class="site-footer">
  <div class="container">
    <small class="block">&copy; 2017 Alex &#39;QWxleA&#39; Poslavsky. All rights reserved.</small>
    <small class="block">Made with <i class="fa fa-heart" aria-hidden="true" style="color:#DD3D36"></i> using <a href="https://github.com/QWxleA/perry.el">Perry.el</a>. Typeface by <a href="https://fonts.google.com/specimen/Inconsolata">Inconsolata</a> and <a href="http://fontawesome.io/">Font Awesome</a>.</small>
    <small><a href="https://github.com/heiswayi/thinkspace">Thinkspace</a> theme by <a href="http://heiswayi.github.io/">Heiswayi Nrird</a>.</small>
  </div>
</footer>

    </div>
    </main>
  </body>
</html>
